app/views/users/show.html.erb

SELECT "instruments".* FROM "instruments" WHERE "instruments"."user_id" = ?  [["user_id", 1]]
---
          </tr>
          <% @user.instruments.each do |instrument| %>

SELECT "genres".* FROM "genres" WHERE "genres"."user_id" = ?  [["user_id", 1]]
---
              </tr>
              <% @user.genres.each do |genre| %>