app/controllers/home_controller.rb

SELECT "users".* FROM "users"
---
  def home
    @users = User.all