app/controllers/users_controller.rb

  def edit
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def updateSurvey
    puts params
    params[:play] = 1
    params[:uid] = session[:user_id]
    # loop through all checkboxes checked for instruments user plays
    # creates entry in Instrument database with plays=1
    params[:instrument].each do |i|
      Instrument.add(i, 1, 1, params[:uid])   # todo: replace paramas with real values for experience and plays
    end
    # loop through all checkboxes checked for instruments user is looking for
    # creates entry in Instrument database with plays=0
    params[:looking].each do |l|
      Instrument.add(l, 1, 0, params[:uid])
    end
    # creating genre entry for each genre checked
    params[:genre].each do |g|
      Genre.add(g, params[:uid])
    end
    influences = params[:influence].split(',')
    influences.each do |i|
      genres = get_genre_from_influence(i)
      Influence.add(i, params[:uid], genres)
    end
    if params[:url] != ''
      if params[:url].include? "youtube"
        media = Medium.add(params, 'youtube')
      elsif params[:url].include? "soundcloud"
        media = Medium.add(params, 'soundcloud')
      end
    end
    User.update_bio(session[:user_id], params[:bio])
---
UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "yoyoydd"], ["updated_at", "2015-11-05 03:37:04.459928"], ["id", 6]]

  def findMatch
    @users = User.ids       # Matching algorithm: Find all users and iterate over them
    me = User.find(session[:user_id])
    @users.each do |u|
      @user = User.find(u)
      # Checks if one user already saw me, or vice versa, and makes sure it's not self
      # If users have never seen each other, then new match is created
      # and user gets to like/dislike user
      if (!Matching.matchExists(@user.uid, me.uid) && !Matching.matchExists(me.uid, @user.uid) && @user.uid != me.uid)
        @userMatch = Matching.createMatch(@user.uid, me.uid)    # Creates the match in the database
---
SELECT  "users".* FROM "users"  ORDER BY RANDOM() LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "matchings" ("user1", "user2", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user1", "10153699791134913"], ["user2", "10153699791134913"], ["status", 0], ["created_at", "2015-11-15 22:52:32.644388"], ["updated_at", "2015-11-15 22:52:32.644388"]]

    sorted = Hash.new

    #GET INSTRUMENTS CURRENT USER WANTS AND PLAYS
    current_user.instruments.each do |inst|
---
SELECT "instruments".* FROM "instruments" WHERE "instruments"."user_id" = ?  [["user_id", 7]]

    end

    #GET GENRES CURRENT USER PLAYS
    current_user.genres.each do |g|
---
SELECT "genres".* FROM "genres" WHERE "genres"."user_id" = ?  [["user_id", 7]]